// โจทย์ ให้เรียงผลลัพธ์ตาม id และ year 
// ถ้า YEAR และ ID เดียวกันจะอยู่ใน ARRAY เดียวกัน 

// ผลลัพธ์
// const output = [
//   [
//     {
//       company: 'ชื่อบริษัท 1',
//       year: '2017',
//       id: 57,
//     },
//   ],
//   [
//     {
//       company: 'ชื่อบริษัท 2',
//       year: '2018',
//       id: 57,
//     },
//   ],
//   [
//     {
//       company: 'ชื่อบริษัท 3',
//       year: '2018',
//       id: 58,
//     },
//   ],
//   [
//     {
//       company: 'ชื่อบริษัท 5',
//       year: '2019',
//       id: 58,
//     },
//     {
//       company: 'ชื่อบริษัท 6',
//       year: '2019',
//       id: 58,
//     },
//   ],
//   [
//     {
//       company: 'ชื่อบริษัท 4',
//       year: '2017',
//       id: 61,
//     },
//   ],
// ]

const data = [
  {
    company: 'ชื่อบริษัท 1',
    year: '2017',
    id: 57,
  },
  {
    company: 'ชื่อบริษัท 2',
    year: '2018',
    id: 57,
  },
  {
    company: 'ชื่อบริษัท 3',
    year: '2018',
    id: 58,
  },
  {
    company: 'ชื่อบริษัท 4',
    year: '2017',
    id: 61,
  },
  {
    company: 'ชื่อบริษัท 5',
    year: '2019',
    id: 58,
  },
  {
    company: 'ชื่อบริษัท 6',
    year: '2019',
    id: 58,
  },
]